Section_4_Real_Workload_Validation/Experiment13/data/raw/case-A/sustained-ramp/trial_012/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 24.411ms, rate sampling interval: 56ms
  Thread calibration: mean lat.: 25.649ms, rate sampling interval: 59ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.57ms   40.36ms 606.72ms   96.98%
    Req/Sec   151.08    192.58   454.00     70.73%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.11ms
 75.000%   25.55ms
 90.000%   31.98ms
 99.000%  223.23ms
 99.900%  535.55ms
 99.990%  593.41ms
 99.999%  603.14ms
100.000%  607.23ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.791     0.000000            1         1.00
      16.543     0.100000         5130         1.11
      18.367     0.200000        10197         1.25
      19.855     0.300000        15311         1.43
      21.039     0.400000        20393         1.67
      22.111     0.500000        25524         2.00
      22.687     0.550000        28068         2.22
      23.311     0.600000        30615         2.50
      24.031     0.650000        33158         2.86
      24.767     0.700000        35713         3.33
      25.551     0.750000        38234         4.00
      25.999     0.775000        39510         4.44
      26.559     0.800000        40795         5.00
      27.279     0.825000        42046         5.71
      28.239     0.850000        43311         6.67
      29.631     0.875000        44590         8.00
      30.623     0.887500        45226         8.89
      31.983     0.900000        45858        10.00
      33.567     0.912500        46496        11.43
      35.615     0.925000        47130        13.33
      38.879     0.937500        47772        16.00
      41.119     0.943750        48086        17.78
      43.775     0.950000        48407        20.00
      47.647     0.956250        48721        22.86
      54.527     0.962500        49040        26.67
      66.303     0.968750        49360        32.00
      72.895     0.971875        49518        35.56
      87.679     0.975000        49678        40.00
     106.047     0.978125        49836        45.71
     119.615     0.981250        49995        53.33
     144.383     0.984375        50154        64.00
     155.647     0.985938        50235        71.11
     177.023     0.987500        50316        80.00
     200.447     0.989062        50396        91.43
     239.231     0.990625        50473       106.67
     276.991     0.992188        50552       128.00
     295.423     0.992969        50592       142.22
     321.535     0.993750        50632       160.00
     352.767     0.994531        50672       182.86
     377.087     0.995313        50712       213.33
     403.455     0.996094        50751       256.00
     426.239     0.996484        50771       284.44
     446.975     0.996875        50791       320.00
     456.959     0.997266        50811       365.71
     477.439     0.997656        50831       426.67
     493.311     0.998047        50854       512.00
     504.319     0.998242        50861       568.89
     508.415     0.998437        50871       640.00
     513.535     0.998633        50881       731.43
     520.959     0.998828        50891       853.33
     536.063     0.999023        50903      1024.00
     538.111     0.999121        50908      1137.78
     547.327     0.999219        50911      1280.00
     560.639     0.999316        50918      1462.86
     562.175     0.999414        50921      1706.67
     566.271     0.999512        50927      2048.00
     566.783     0.999561        50928      2275.56
     575.487     0.999609        50933      2560.00
     575.487     0.999658        50933      2925.71
     579.583     0.999707        50936      3413.33
     583.167     0.999756        50938      4096.00
     584.191     0.999780        50939      4551.11
     591.359     0.999805        50941      5120.00
     591.871     0.999829        50942      5851.43
     592.895     0.999854        50944      6826.67
     592.895     0.999878        50944      8192.00
     593.407     0.999890        50945      9102.22
     602.111     0.999902        50947     10240.00
     602.111     0.999915        50947     11702.86
     602.111     0.999927        50947     13653.33
     602.111     0.999939        50947     16384.00
     603.135     0.999945        50949     18204.44
     603.135     0.999951        50949     20480.00
     603.135     0.999957        50949     23405.71
     603.135     0.999963        50949     27306.67
     603.135     0.999969        50949     32768.00
     603.135     0.999973        50949     36408.89
     603.135     0.999976        50949     40960.00
     603.135     0.999979        50949     46811.43
     607.231     0.999982        50950     54613.33
     607.231     1.000000        50950          inf
#[Mean    =       28.569, StdDeviation   =       40.364]
#[Max     =      606.720, Total count    =        50950]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  53702 requests in 3.00m, 43.69MB read
Requests/sec:    298.31
Transfer/sec:    248.49KB